package email

/*

import (
	"time"

	"github.com/COTBU/notifier/config"
	"github.com/COTBU/notifier/model"
	"sotbisrv/test"
)

var senderMock = client{
	config: &config.Config{
		Email: struct {
			Host string
			Port uint32
			User string
		}{
			Host:      "192.168.80.252",
			Port:      25,
			Templates: "../../assets/email-templates",
		},
	},
	credentials: &Credentials{
		From: "mst@grp.loc",
		To:   []string{"alimv@grp.loc", "amanda@grp.loc"},
	},
}

var (
	location = time.FixedZone("UTC+3", 3*60*60)
	start    = time.Date(2021, 12, 1, 0, 0, 0, 0, location)
	end      = time.Date(2023, 12, 2, 23, 59, 59, 0, location)
)

var accountStatementDataNew = model.AccountStatementRequest{
	ID:           30368,
	Status:       "open",
	BankDetailID: 51,
	BankDetail: &model.BankDetail{
		Debtor: &model.Debtor{
			Name: "Test Debtor",
		},
		Bank:        &test.TestString,
		BankAccount: test.TestString,
	},
	Start:       &start,
	End:         &end,
	RequestType: 2,
	Creator: &model.User{
		User: "user1",
	},
	CreatedAt:     &start,
	RequestReason: &test.TestString,
}

var templateAccountStatementNew = `
Поступила новая заявка на выписку с расчётного счёта: [перейти к заявке № {{.Data.ID}}](http://{{.IP}}/requests/account-statement/{{.Data.ID}})

|                 |                                                              |
|-----------------|--------------------------------------------------------------|
| Владелец счёта: | {{.Data.BankDetail.Debtor.Name}}                             |
| Расчётный счёт: | {{.Data.BankDetail.BankAccount}} ({{.Data.BankDetail.Bank}}) |

|                  |                                                                            |
|------------------|----------------------------------------------------------------------------|
| Период:          | с {{.Data.Start.Format "02.01.2006"}} по {{.Data.End.Format "02.01.2006"}} |
| Вид выписки:     | {{getRequestFiles .Data.RequestType}}                                                      |
| **Комментарий:** | **{{.Data.RequestReason}}**                                                |

|           |                                         |
|-----------|-----------------------------------------|
| Заказчик: | {{.Data.Creator.User}}                  |
| Дата:     | {{.Data.CreatedAt.Format "02.01.2006"}} |
`

var result = `<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="utf-8" />
  <title></title>
</head>
<body>
  <header>
    <a
      href="http://192.168.80.30/"
      style="text-decoration: none;"
      class="external-link"
      title="bee.hive"
      target="_blank"
      rel="noreferrer"
    >
      <table>
        <tr>
          <td>
            <svg
              width="21"
              height="21"
              viewBox="0 0 21 21"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M0.338544 12.2839C0.12964 12.405 0 12.6307 0 12.8729V17.2589C0 17.5011 0.12964 17.7268 0.338544 17.848L4.11932 20.041C4.32822 20.162 4.5875 20.162 4.7964 20.041L8.57735 17.848C8.78615 17.7268 8.9159 17.5011 8.9159 17.2589V12.8729C8.9159 12.6307 8.7861 12.405 8.57735 12.2839L4.7964 10.0909C4.5875 9.96971 4.32822 9.96971 4.11932 10.0909L0.338544 12.2839Z"
                fill="#1399CF"
              />
              <path
                d="M12.4227 12.1521C12.2138 12.2733 12.0841 12.4989 12.0841 12.7412V17.1271C12.0841 17.3694 12.2138 17.5951 12.4227 17.7163L16.2034 19.9092C16.4124 20.0302 16.6716 20.0302 16.8805 19.9092L20.6615 17.7163C20.8703 17.5951 21 17.3694 21 17.1271V12.7412C21 12.4989 20.8702 12.2733 20.6615 12.1521L16.8805 9.95915C16.6716 9.838 16.4124 9.838 16.2034 9.95915L12.4227 12.1521Z"
                fill="#FF9124"
              />
              <path
                d="M6.8806 2.28385C6.6717 2.40501 6.54205 2.63066 6.54205 2.8729V7.25884C6.54205 7.50109 6.6717 7.72684 6.8806 7.84799L10.6614 10.0409C10.8703 10.1619 11.1296 10.1619 11.3385 10.0409L15.1194 7.84799C15.3283 7.72684 15.4579 7.50109 15.4579 7.25884V2.8729C15.4579 2.63066 15.3282 2.40501 15.1194 2.28385L11.3385 0.090875C11.1296 -0.0302917 10.8703 -0.0302917 10.6614 0.090875L6.8806 2.28385Z"
                fill="#1399CF"
              />
            </svg>
          </td>
          <td style="color: #454545; font: Open Sans; font-size: 14px;">
            <span>bee.hive</span><br/>
            <span style="font-size: 10px;">корпоративный портал</span>
          </td>
          <td>
            <svg
              style="margin-left: 330px;"
              width="205"
              height="31"
              viewBox="0 0 205 31"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <mask
                id="mask0"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="84"
                y="2"
                width="20"
                height="23"
              >
                <path
                  d="M84.7594 7.12312C84.2908 7.39489 84 7.90106 84 8.44447V18.283C84 18.8264 84.2908 19.3327 84.7594 19.6045L93.2403 24.5237C93.7091 24.7951 94.2906 24.7951 94.7592 24.5237L103.241 19.6045C103.709 19.3327 104 18.8264 104 18.283V8.44447C104 7.90106 103.709 7.39489 103.241 7.12312L94.7592 2.20382C94.2906 1.93206 93.7091 1.93206 93.2403 2.20382L84.7594 7.12312Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask0)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M84.18 4.89998C82.6944 6.75423 81.7926 9.00779 81.5891 11.3751C81.3855 13.7423 81.8892 16.1167 83.0364 18.1974C84.1837 20.2781 85.9228 21.9713 88.0333 23.0626C90.1439 24.1539 92.5309 24.5941 94.8919 24.3274C97.2529 24.0607 99.4816 23.0991 101.295 21.5645C103.109 20.0299 104.427 17.9914 105.081 15.7072C105.735 13.423 105.697 10.9961 104.97 8.73388C104.244 6.47168 102.862 4.4761 101 2.99999C95.826 -1.10201 88.309 -0.253016 84.18 4.89998Z"
                    fill="#FF9124"
                  />
                </g>
              </g>
              <mask
                id="mask1"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="136"
                y="26"
                width="20"
                height="23"
              >
                <path
                  d="M136.759 31.1231C136.291 31.3949 136 31.9011 136 32.4445V42.283C136 42.8264 136.291 43.3327 136.759 43.6045L145.24 48.5237C145.709 48.7951 146.291 48.7951 146.759 48.5237L155.241 43.6045C155.709 43.3327 156 42.8264 156 42.283V32.4445C156 31.9011 155.709 31.3949 155.241 31.1231L146.759 26.2038C146.291 25.9321 145.709 25.9321 145.24 26.2038L136.759 31.1231Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask1)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M136.635 30.4969C135.149 32.3512 134.248 34.6047 134.044 36.972C133.841 39.3392 134.344 41.7136 135.492 43.7943C136.639 45.875 138.378 47.5683 140.488 48.6596C142.599 49.7509 144.986 50.191 147.347 49.9243C149.708 49.6576 151.937 48.6961 153.751 47.1615C155.564 45.6269 156.882 43.5883 157.536 41.3041C158.19 39.02 158.152 36.593 157.425 34.3308C156.699 32.0686 155.317 30.073 153.455 28.5969C148.281 24.4949 140.764 25.3439 136.635 30.4969Z"
                    fill="#1399CF"
                  />
                </g>
              </g>
              <mask
                id="mask2"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="15"
                y="6"
                width="36"
                height="41"
              >
                <path
                  d="M16.367 15.2216C15.5235 15.7108 15 16.6219 15 17.6V35.3093C15 36.2875 15.5235 37.1988 16.367 37.6882L31.6326 46.5427C32.4763 47.0313 33.5231 47.0313 34.3666 46.5427L49.633 37.6882C50.4763 37.1988 51 36.2875 51 35.3093V17.6C51 16.6219 50.4759 15.7108 49.633 15.2216L34.3666 6.36688C33.5231 5.87771 32.4763 5.87771 31.6326 6.36688L16.367 15.2216Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask2)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M16.13 12.2C8.50001 21.776 10.078 35.7229 19.653 43.3529C29.227 50.9829 43.175 49.4079 50.806 39.8329C58.437 30.2599 56.863 16.3129 47.29 8.67993C37.712 1.05093 23.764 2.62695 16.13 12.2Z"
                    fill="#1399CF"
                  />
                </g>
              </g>
              <mask
                id="mask3"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="147"
                y="27"
                width="18"
                height="21"
              >
                <path
                  d="M147.683 31.6108C147.262 31.8554 147 32.311 147 32.8V41.6547C147 42.1437 147.262 42.5994 147.683 42.8441L155.316 47.2714C155.738 47.5156 156.262 47.5156 156.683 47.2714L164.317 42.8441C164.738 42.5994 165 42.1437 165 41.6547V32.8C165 32.311 164.738 31.8554 164.317 31.6108L156.683 27.1834C156.262 26.9389 155.738 26.9389 155.316 27.1834L147.683 31.6108Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask3)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M147.33 31.09C143.502 35.903 144.298 42.907 149.108 46.739C153.918 50.569 160.923 49.779 164.758 44.971C168.592 40.163 167.805 33.158 163 29.32C161.855 28.4072 160.541 27.7289 159.134 27.3238C157.727 26.9188 156.253 26.7949 154.798 26.9592C153.343 27.1236 151.935 27.573 150.653 28.2818C149.372 28.9905 148.243 29.9447 147.33 31.09Z"
                    fill="#EBEBEB"
                  />
                </g>
              </g>
              <mask
                id="mask4"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="93"
                y="10"
                width="26"
                height="30"
              >
                <path
                  d="M93.9873 16.6601C93.3781 17.0134 93 17.6714 93 18.3778V31.1678C93 31.8743 93.3781 32.5325 93.9873 32.8859L105.012 39.2808C105.622 39.6337 106.378 39.6337 106.987 39.2808L118.013 32.8859C118.622 32.5325 119 31.8743 119 31.1678V18.3778C119 17.6714 118.621 17.0134 118.013 16.6601L106.987 10.265C106.378 9.91168 105.622 9.91168 105.012 10.265L93.9873 16.6601Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask4)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M104.352 8.22111C95.6376 9.68511 89.7596 17.9361 91.2236 26.6501C92.6866 35.3641 100.938 41.2421 109.652 39.7791C118.367 38.3161 124.245 30.0651 122.782 21.3511C122.434 19.2788 121.681 17.2953 120.567 15.5139C119.452 13.7325 117.998 12.1881 116.286 10.9688C114.575 9.74957 112.64 8.87936 110.592 8.40791C108.544 7.93645 106.424 7.87298 104.352 8.22111Z"
                    fill="#EBEBEB"
                  />
                </g>
              </g>
              <mask
                id="mask5"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="126"
                y="8"
                width="8"
                height="10"
              >
                <path
                  d="M126.304 10.0492C126.116 10.158 126 10.3604 126 10.5778V14.5132C126 14.7305 126.116 14.9331 126.304 15.0418L129.696 17.0095C129.884 17.1181 130.116 17.1181 130.304 17.0095L133.696 15.0418C133.884 14.9331 134 14.7305 134 14.5132V10.5778C134 10.3604 133.884 10.158 133.696 10.0492L130.304 8.08153C130.116 7.97282 129.884 7.97282 129.696 8.08153L126.304 10.0492Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask5)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M134.482 9.78246C133.257 7.3085 130.259 6.29555 127.785 7.51926C125.311 8.74246 124.296 11.74 125.517 14.2155C125.808 14.8042 126.213 15.3298 126.707 15.7623C127.201 16.1948 127.775 16.5258 128.397 16.7362C129.019 16.9467 129.677 17.0326 130.332 16.989C130.987 16.9453 131.627 16.7731 132.216 16.482C132.805 16.1909 133.33 15.7867 133.763 15.2925C134.195 14.7983 134.526 14.2237 134.736 13.6016C134.947 12.9795 135.033 12.322 134.989 11.6668C134.945 11.0115 134.773 10.3712 134.482 9.78246Z"
                    fill="#FF9124"
                  />
                </g>
              </g>
              <mask
                id="mask6"
                mask-type="alpha"
                maskUnits="userSpaceOnUse"
                x="-1"
                y="4"
                width="9"
                height="11"
              >
                <path
                  d="M-0.658256 6.30541C-0.869126 6.4277 -1 6.65548 -1 6.90001V11.3273C-1 11.5719 -0.869126 11.7997 -0.658256 11.922L3.15816 14.1357C3.36908 14.2578 3.63077 14.2578 3.84164 14.1357L7.65826 11.922C7.86908 11.7997 8 11.5719 8 11.3273V6.90001C8 6.65548 7.86897 6.4277 7.65826 6.30541L3.84164 4.09172C3.63077 3.96943 3.36908 3.96943 3.15816 4.09172L-0.658256 6.30541Z"
                  fill="#FF9124"
                />
              </mask>
              <g mask="url(#mask6)">
                <g style="mix-blend-mode:multiply">
                  <path
                    d="M5.88859 4.62058C5.26356 4.29116 4.57977 4.08809 3.87626 4.02293C3.17275 3.95777 2.4633 4.0318 1.7884 4.24082C1.1135 4.44984 0.486381 4.78976 -0.0571514 5.24114C-0.600684 5.69251 -1.05 6.24652 -1.37942 6.87154C-1.70884 7.49655 -1.91192 8.18033 -1.97707 8.88383C-2.04223 9.58733 -1.96817 10.2968 -1.75915 10.9716C-1.55012 11.6465 -1.21023 12.2736 -0.758842 12.8172C-0.307457 13.3607 0.246564 13.81 0.87159 14.1394C2.13389 14.8047 3.60877 14.9413 4.97178 14.5192C6.33479 14.097 7.4743 13.1507 8.1396 11.8884C8.80489 10.6262 8.9415 9.15132 8.51936 7.78833C8.09721 6.42534 7.15089 5.28586 5.88859 4.62058Z"
                    fill="#EBEBEB"
                  />
                </g>
              </g>
            </svg>
          </td>
        </tr>
      </table>
      <svg
        width="200"
        height="1"
        viewBox="0 0 200 1"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <line y1="0.5" x2="200" y2="0.5" stroke="#DFDFDF"/>
      </svg>
    </a>
  </header>
<p>Поступила новая заявка на выписку с расчётного счёта: <a href="http://192.168.80.30/requests/account-statement/30368">перейти к заявке № 30368</a></p>
<table>
<thead>
<tr>
<th></th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td>Владелец счёта:</td>
<td>Test Debtor</td>
</tr>
<tr>
<td>Расчётный счёт:</td>
<td>TestString (TestString)</td>
</tr>
</tbody>
</table>
<table>
<thead>
<tr>
<th></th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td>Период:</td>
<td>с 01.12.2021 по 02.12.2022</td>
</tr>
<tr>
<td>Вид выписки:</td>
<td>PDF</td>
</tr>
<tr>
<td><strong>Комментарий:</strong></td>
<td><strong>TestString</strong></td>
</tr>
</tbody>
</table>
<table>
<thead>
<tr>
<th></th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td>Заказчик:</td>
<td>user1</td>
</tr>
<tr>
<td>Дата:</td>
<td>01.12.2021</td>
</tr>
</tbody>
</table>
  <footer>
    <table style="margin:0; margin-top: 20px; padding:0; border:0;"
    >
      <tr>
        <td
          style="color: #454545; font: 11px Open Sans, sans-serif; line-height: 30px;"
        >
        <span>
          <svg
            width="200"
            height="1"
            viewBox="0 0 200 1"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <line y1="0.5" x2="200" y2="0.5" stroke="#DFDFDF"/>
          </svg>
          <br/>
          Данное сообщение сформировано автоматически, пожалуйста, не
          отвечайте на него.
        </span>
        </td>
      </tr>
    </table>
  </footer>
</body>
</html>
`
*/
